# data-database-types-relational-language-SQL-MySQL-C_R_UD-read-command-SELECT-process-subquery
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

```sql
use employees;
Database changed
```

```sql
mysql> show tables;
+---------------------+
| Tables_in_employees |
+---------------------+
| employees           |
| salaries            |
+---------------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SHOW CREATE TABLE employees;
+-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Table     | Create Table                                                                                                                                                                                                                                                                             |
+-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| employees | CREATE TABLE `employees` (
  `emp_no` int NOT NULL,
  `birth_date` date NOT NULL,
  `first_name` varchar(14) NOT NULL,
  `last_name` varchar(16) NOT NULL,
  `gender` enum('M','F') NOT NULL,
  `hire_date` date NOT NULL,
  PRIMARY KEY (`emp_no`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 |
+-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row in set (0.00 sec)
```

- **table** - entity - relation - salaries - **foreign** **key** - **column** - attribute - field - emp_no - **references** - **other** **table** - entity - relation - employees - the column - attribute - field - emp_no - **constraint** specifies only employees in the table - entity - relation - employees - can be given a salary [1]

```sql
CONSTRAINT `salaries_ibfk_1` FOREIGN KEY (`emp_no`) REFERENCES `employees` (`emp_no`) ON DELETE CASCADE
```

```sql
mysql> SHOW CREATE TABLE salaries;
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Table    | Create Table                                                                                                                                                                                                                                                                                                                                        |
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| salaries | CREATE TABLE `salaries` (
  `emp_no` int NOT NULL,
  `salary` int NOT NULL,
  `from_date` date NOT NULL,
  `to_date` date NOT NULL,
  PRIMARY KEY (`emp_no`,`from_date`),
  KEY `emp_no` (`emp_no`),
  CONSTRAINT `salaries_ibfk_1` FOREIGN KEY (`emp_no`) REFERENCES `employees` (`emp_no`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 |
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row in set (0.00 sec)
```

- returned rows - records - tuples - from columns - attributes - fields - emp_no - first_name - last_name - from table - entity - relation - employees - **join** - **INNER** **JOIN** - each row - record - tuple - in the table - entity - relation - employees - to each row - record - tuple - in the other table - entity - relation - salaries - only way to join is when the value of the column - attribute - field - emp_no - in both tables - entities - relations - are the same value - employees - emp_no - equals - salaries - emp_no - join **must** **be** **on** - **foreign** **key** [1]

- **clause** - **WHERE** - table - entity - relation - salaries - column - attribute - field - salary - betwen 99000 and 999999  - **operator** - **BETWEEN** - **operator** - **AND** [1]

```sql
mysql> SELECT employees.emp_no,employees.first_name,employees.last_name
    -> FROM employees
    -> INNER JOIN salaries
    -> ON employees.emp_no=salaries.emp_no
    -> WHERE salaries.salary BETWEEN 99000 AND 99999;
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10017 | Cristinel  | Bouloucos |
|  10066 | Kwee       | Schusler  |
+--------+------------+-----------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT e.emp_no,e.first_name,e.last_name
    -> FROM employees e
    -> INNER JOIN salaries s
    -> ON e.emp_no=s.emp_no
    -> WHERE s.salary BETWEEN 99000 AND 99999;
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10017 | Cristinel  | Bouloucos |
|  10066 | Kwee       | Schusler  |
+--------+------------+-----------+
2 rows in set (0.00 sec)
```

- returned - **query** **within** a **query** - **join** - **INNER** **JOIN** - **written** as a **subquery** - **parentheses** **indicate** **precedence** - inner - subquery - executed first [1]

```sql
mysql> SELECT e.emp_no,e.first_name,e.last_name
    -> FROM employees e
    -> WHERE e.emp_no IN(
    ->   SELECT s.emp_no
    ->   FROM salaries s
    ->   WHERE s.salary BETWEEN 99000 AND 99999
    -> );
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10017 | Cristinel  | Bouloucos |
|  10066 | Kwee       | Schusler  |
+--------+------------+-----------+
2 rows in set (0.01 sec)
```

- **inner** - **query** - returned rows - records - tuples - from table - entity - relation - salaries - the column - attribute - field - emp_no - clause - WHERE - column - attribute - field - salary - operator - BETWEEN - 99000 - operator - AND - 99999 [1]

```sql
mysql> SELECT s.emp_no
    -> FROM salaries s
    -> WHERE s.salary BETWEEN 99000 AND 99999;
+--------+
| emp_no |
+--------+
|  10017 |
|  10066 |
+--------+
2 rows in set (0.00 sec)
```

- **outermost** - **query** - returned rows - records - tuples - from table - entity - relation - employees - the columns - attributes - fields - emp_no - first_name - last_name - clause - WHERE - column - attribue - field - emp_no - **operator** - **IN** - **subquery** - **replaced** with the **result** of the **subquery** [1]

```sql
mysql> SELECT e.emp_no,e.first_name,e.last_name
    -> FROM employees e
    -> WHERE e.emp_no IN(
    ->   10017,10066
    -> );
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10017 | Cristinel  | Bouloucos |
|  10066 | Kwee       | Schusler  |
+--------+------------+-----------+
2 rows in set (0.00 sec)
```

- returned rows - records - tuples - from table - entity - relation - employees - the columns - attributes - fields - emp_no - first_name - last_name - of employee with the highest salary - columns - attributes - fields - over two tables - entities - relations - employees - salaries - joined by - foreign key - table - entity - relation - salaries - foreign key - column - attribute - field - emp_no - references - other table - entity - relation - employees - the column - attribute - field - emp_no [1]

- same logical information is in both tables - entities - relations - the column - attribute - field - emp_no - **query** - **containing** **a** **query** - **again** **containing** **another** **query** [1]

- three separate queries - **result** of a **query** **fed** **into** **another** **query** [1]

```sql
mysql> SELECT e.emp_no,e.first_name,e.last_name
    -> FROM employees e
    -> WHERE e.emp_no IN(
    ->   SELECT s.emp_no
    ->   FROM salaries s
    ->   WHERE s.salary=(
    ->     SELECT MAX(s.salary)
    ->     FROM salaries s
    ->   )
    -> );
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10068 | Charlene   | Brattka   |
+--------+------------+-----------+
1 row in set (0.00 sec)
```

- **inner** - **query** - returned row - record - tuple - from table - entity - relation - salaries - where **column** - attribute - field - salary - passed as - **parameter** - **function** - **MAX** - always **returns** just a **single** **value** - even if two or more values are equal to the maximum [1]


- **subquery** **replaced** by the **result** of the **subquery** [1]

```sql
mysql> SELECT MAX(s.salary)
    -> FROM salaries s;
+---------------+
| MAX(s.salary) |
+---------------+
|        113229 |
+---------------+
1 row in set (0.00 sec)
```

- **next** **query** - returned rows - records - tuples - from table - entity - relation - salaries - the **column** - attribute - field - emp_no - **clause** - **WHERE** - the **column** - attribute - field - salary - **equal** **result** of the **inner** **subquery** - 113229 - possible to have one or more employee numbers returned [1]


- **subquery** **replaced** by the **result** of the **subquery** [1]

```sql
mysql> SELECT s.emp_no
    -> FROM salaries s
    -> WHERE s.salary=(
    ->   113229
    -> );
+--------+
| emp_no |
+--------+
|  10068 |
+--------+
1 row in set (0.00 sec)
```

- **outermost** **query** - returned rows - records - tuples - from table - entity - relation - employees - the **columns** - attributes - fields - emp_no - first_name - last_name - **clause** - **WHERE** - the **column** - attribute - field - emp_no - **operator** - **IN** - **result** of the **previous** **subquery** - 10068 - possible to have one or more employee numbers returned [1]

```sql
mysql> SELECT e.emp_no,e.first_name,e.last_name
    -> FROM employees e
    -> WHERE e.emp_no IN(
    ->   10068
    -> );
+--------+------------+-----------+
| emp_no | first_name | last_name |
+--------+------------+-----------+
|  10068 | Charlene   | Brattka   |
+--------+------------+-----------+
1 row in set (0.00 sec)
```

***
# END